function begin(){
    var nd = document.createElement('div');
    var info = '0. <b>Для чего служит целочисленный тип int</b><br/>+Хранится в памяти с использованием двух байт (16 бит). Может содержать целое число в диапазоне от -32 768 до 32 767.<br/><br/>1. <b>Какая функция класса SD удаляет папку на карте памяти SD?</b><br/>+Функция rmdir()<br/><br/>2. <b>RGB- светодиод это?</b><br/>+Три близко расположенных светодиода (красный зеленый синий)<br/><br/>3. <b>Какая функция класса File записывает данные в открытый для записи файл?</b><br/>+Функция print()<br/><br/>4. <b>Для чего служит тип данных float</b><br/>+служит для хранения чисел с плавающей запятой.<br/><br/>5. <b>Тип памяти RFID–RO (read only)</b><br/>+Данные записываются только один раз, сразу при изготовлении, пригодны только для идентификации<br/><br/>6. <b>Какая функция служит для задержки исполнения кода</b><br/>+delay()<br/><br/>7. <b>В составе дальномера имеются?</b><br/>+Два пьезоэлемента<br/><br/>8. <b>Функция write()</b><br/>+Записывает символ в жидкокристаллический индикатор<br/><br/>9. <b>Для чего служит string</b><br/>+для объявления текстовых строки<br/><br/>10. <b>Стандартная скорость аналогового вывода</b><br/>+9600<br/><br/>11. <b>Для чего служит функция pinMode</b><br/>+Устанавливает режим работы заданного входа/выхода (pin) как входа или как выхода<br/><br/>12. <b>Функция autoscroll()</b><br/>+Включает автоматическую прокрутку экрана жидкокристаллического индикатора<br/><br/>13. <b>Какую часть программы обычно используют для инициализации входов и выходов</b><br/>+setup()<br/><br/>14. <b>В каком году широкую популярность получил интерфейс PS/2?</b><br/>+1980<br/><br/>15. <b>Функция onReceive()</b><br/>+Регистрирует функцию, которая должна быть вызвана, когда slave получит данные от master.<br/><br/>16. <b>Какая функция класса File проверяет, есть ли доступный для чтения байт в открытом файле?</b><br/>+available()<br/><br/>17. <b>Сколько цифровых входов/выходов имеет плата Arduino Mega</b><br/>+54<br/><br/>18. <b>Сколько вольт нужно для питания датчика HC-SR04</b><br/>+5 В<br/><br/>19. <b>Для чего служит функция digitalWrite()</b><br/>+Подает HIGH или LOW значение на цифровой вход/выход (pin)<br/><br/>20. <b>Для чего служит Функция digitalRead()</b><br/>+Функция считывает значение с заданного входа: HIGH или LOW.<br/><br/>21. <b>Для чего служит Функция analogRead()</b><br/>+Считывает значение с указанного аналогового входа<br/><br/>22. <b>Какая функция выводит на экран жидкокристаллического индикатора курсора?</b><br/>+cursor().<br/><br/>23. <b>Какой класс предоставляет функции доступа к карте памяти SD и манипулирования файлами и каталогами</b><br/>+Класс SD<br/><br/>24. <b>Какая функция класса File записывает данные в файл, который был открыт для записи, данные дополняются символами перевода строки?</b><br/>+Функция println()<br/><br/>25. <b>Какой язык программирования используется для программирования платы Arduino</b><br/>+C++<br/><br/>26. <b>Сколько аналоговых входов/выходов имеет плата Arduino Mega</b><br/>+16<br/><br/>27. <b>Какие варианты интерфейса поддерживает WH1604</b><br/>+4-битный и 8-битный<br/><br/>28. <b>Функции класса Serial</b><br/>+Все ответы верны<br/><br/>29. <b>Базовая система RFID состоит из</b><br/>+Все ответы верны<br/><br/>30. <b>По типу источника питания RFID-метки делятся на:</b><br/>+Все ответы верны<br/><br/>31. <b>Полупроводниковый прибор, преобразующий пропускаемый через него электрический ток в световое излучение?</b><br/>+Светодиод<br/><br/>32. <b>Синтаксис функции write() класса File?</b><br/>+myFile.write(data) / (buf, len)<br/><br/>33. <b>Функция blink()</b><br/>+Выводит на экран жидкокристаллического индикатора мигающий курсор<br/><br/>34. <b>Функция noBlink()</b><br/>+Выключает мигающий курсор на экране жидкокристаллического индикатора<br/><br/>35. <b>Функция begin()</b><br/>+Инициализирует библиотеку OneWire.<br/><br/>36. <b>В чем отличие типа int от unsigned int</b><br/>+Хранит числа больше или равные нулю<br/><br/>37. <b>Функция micros()</b><br/>+Возвращает кол-во микросекунд с начала выполнения программы на плате Arduino<br/><br/>38. <b>Существует несколько способов систематизации RFID-меток и систем:</b><br/>+По размеру платы<br/><br/>39. <b>Как определить анод у светодиода</b><br/>+Более длинная ножка<br/><br/>40. <b>С чем совместим Arduino Ethernet Shield</b><br/>+EEE802.3af<br/><br/>41. <b>Помещенные на одну плату приемник и передатчик ультразвукового сигнала.</b><br/>+Ультразвуковой дальномер<br/><br/>42. <b>Какая функция класса SD проверяет, существует ли на карте SD файл или каталог?</b><br/>+Функция exists()<br/><br/>43. <b>Функция noCursor()</b><br/>+Скрывает курсор с экрана жидкокристаллического индикатора<br/><br/>44. <b>Библиотека LiquidCrystalRus:</b><br/>+Библиотека, которая умело справляется с китайской кириллицей, делая ее поддержку прозрачной<br/><br/>45. <b>Функция requestFrom()</b><br/>+Запрашивает байты с другого устройства<br/><br/>46. <b>Функция endTransmission()</b><br/>+Завершает передачу на slave-устройство<br/><br/>47. <b>Электронный источник света?</b><br/>+Светодиод<br/><br/>48. <b>Частота на которой работает метка диапазона LF?</b><br/>+125-134 кГц<br/><br/>49. <b>Функция createChar()</b><br/>+Создает пользовательский символ (глиф) для использования на жидкокристаллическом дисплее<br/><br/>50. <b>Какая функция класса File считывает байт из файла из текущей позиции, не продвигаясь к следующей?</b><br/>+Функция peek()<br/><br/>51. <b>Какая функция класса File возвращает имя следующего по позиции файла из каталога?</b><br/>+Функция openNextFile()<br/><br/>52. <b>Функции библиотек EEPROM</b><br/>+Чтения и записи в память данных<br/><br/>53. <b>Какие две линии используются для обмена информации по PS/2?</b><br/>+DATA и CLOCK<br/><br/>54. <b>Какая функция класса File приведет вас обратно, в первый файл в каталоге (используется в сочетании с openNextFile())?</b><br/>+rewindDirectory()<br/><br/>55. <b>Для чего служит — boolean</b><br/>+Логический (булевый) тип данных<br/><br/>56. <b>Как аргумент принимает функция delay()</b><br/>+Число<br/><br/>57. <b>Для чего служит переменная char</b><br/>+Хранить один алфавитно-цифровой символ (литеру)<br/><br/>58. <b>Полупассивные RFID-метки</b><br/>+Оснащены батареей<br/><br/>59. <b>Библиотека в Arduino, для работы с дальномером?</b><br/><br/>60. <b>Функция home()</b><br/>+Располагает курсор в верхнем левом углу жидкокристаллического индикатора.<br/><br/>61. <b>Особенности технологии RFID</b><br/>+Возможность чтения/записи информации<br/><br/>62. <b>Какие материал считается лучшим для излучения в светодиоде</b><br/>+Арсенид галлия<br/><br/>63. <b>Как должен проходить переход электрический ток через светодиод?</b><br/>+p-n-переход<br/><br/>64. <b>Для чего служит переменная unsigned int</b><br/>+Для хранения только положительных целых чисел в диапазоне от 0 до 65535<br/><br/>65. <b>Международные организации-разработчики стандартов</b><br/>+Все ответы верны<br/><br/>66. <b>Технология автоматической бесконтактной идентификации объектов при помощи радиочастотного канала связи</b><br/>+Радиочастотная идентификация<br/><br/>67. <b>Функция noDisplay()</b><br/>+Выключает жидкокристаллический индикатор без потери отображаемой на нем информации.<br/><br/>68. <b>Сколько ножек имеется у RGB светодиода</b><br/>+4<br/><br/>69. <b>Функция millis()</b><br/>+Возвращает количество миллисекунд с момента начала выполнения текущей программы на плате Arduino<br/><br/>70. <b>Что создаёт функция ethernetServer()</b><br/>+Сервер, который прослушивает входящие соединения на указанный порт<br/><br/>71. <b>Функция scrollDisplayLeft()</b><br/>+Прокручивает информацию на экране индикатора на одно знакоместо влево.<br/><br/>72. <b>Функция available()</b><br/>+Возвращает число байтов, доступных для получения функцией receive().<br/><br/>73. <b>Для чего служит переменная unsigned long</b><br/>+Для хранения положительных целых чисел от 0 до 4 294 967 295<br/><br/>74. <b>Какая функция класса SD инициализирует библиотеку SD, назначая вывод для сигнала SS (Slave Select).</b><br/>+Функция begin()<br/><br/>75. <b>Какая функция класса File возвращает текущую позицию в файле, куда следует байт будет записываться или откуда считываться?</b><br/>+Функция position()<br/><br/>76. <b>Активные RFID-метки</b><br/>+Обладают собственным источником питания<br/><br/>77. <b>Синтаксис функции seek() класса File?</b><br/>+myFile.seek(pos)<br/><br/>78. <b>Какой способ питания отсутствует у датчиков семейства DHT?</b><br/>+Паразитный<br/><br/>79. <b>Функция shiftOut()</b><br/>+Выводит байт информации на порт входа/выхода последовательно (побитно)<br/><br/>80. <b>Какая функция выводит на экран мигающий курсор?</b><br/>+blink()<br/><br/>81. <b>По рабочей частоте RFID-метке делятся на</b><br/>+Все, кроме HE<br/><br/>82. <b>Что такое 1-Wire?</b><br/>+обеспечивает низкоскоростной интерфейс для данных<br/><br/>83. <b>Функция clear()</b><br/>+очищает экран жидкокристаллического индикатора<br/><br/>84. <b>Для вывода переменной X на монитор порта следует прописать</b><br/>+Serial.print(X)<br/><br/>85. <b>Сколько раз выполняется инструкция setup()</b><br/>+Только один<br/><br/>86. <b>Для считывания значений с аналогового входа используется команда</b><br/>+analogRead()<br/><br/>87. <b>Команда delay приостанавливает программу на заданное количество</b><br/>+милисекунд<br/><br/>88. <b>Какая функция восстанавливает текст, который был на дисплее?</b><br/>+display()<br/><br/>89. <b>Сколько необходимо проводов для связи с устройством по 1-Wire?</b><br/>+Два<br/><br/>90. <b>Для считывания значений с цифрового входа используется команда</b><br/>+digitalRead()<br/><br/>91. <b>Какой код отвечает за удаление ключа из отвечающих?</b><br/>+delete_key()<br/><br/>92. <b>Функция noTone()</b><br/>+Останавливает сигнал, генерируемый на порту входа/выхода, вызовом функции tone()<br/><br/>93. <b>Для включения библиотек в скетч используется</b><br/>+#include<br/><br/>94. <b>Цикл for используется для</b><br/>+повторения операторов, заключенных в фигурные скобки<br/><br/>95. <b>Тип памяти RFID –WORM?</b><br/>+Содержат блок однократно записываемой памяти, можно многократно читать<br/><br/>96. <b>Функция noAutoscroll()</b><br/>+выключает автоматическую прокрутку экрана жидкокристаллического индикатора.<br/><br/>97. <b>Функции класса File?</b><br/>+Все ответы верны<br/><br/>98. <b>Функция onRequest()</b><br/>+регистрирует функцию, которая должна быть вызвана, когда master запросит данные от slave<br/><br/>99. <b>Для чего используется { }</b><br/>+Используются для определения начала и конца блока команд (используются в функциях и циклах)<br/><br/>100. <b>Какая функция класса File возвращает размер файла в байтах?</b><br/>+Функция size()<br/><br/>101. <b>Что означают буквы GND на Arduino?</b><br/>+Землю<br/><br/>102. <b>Для чего используется /* */ (многострочный комментарий)</b><br/>+Можно использовать эту структуру, если Вам надо создать подробный комментарий на нескольких строках. Все находящееся между этими символами будет игнорироваться компилятором.<br/><br/>103. <b>Функция rightToLeft()</b><br/>+устанавливает направление вывода символов на экран жидкокристаллического индикатора справа налево<br/><br/>104. <b>Какая функция очищает экран жидкокристаллического индикатора?</b><br/>+clear()<br/><br/>105. <b>Функция tone()</b><br/>+Генерирует на порту входа/выхода сигнал — прямоугольную "волну" заданной частоты и с 50 % рабочим циклом<br/><br/>106. <b>Тип памяти RFID –RW?</b><br/>+содержат идентификатор и блок памяти для чтения/записи информации<br/><br/>107. <b>Что позволяет использовать интерфейс 1-Wire?</b><br/>+библиотеку OneWire.<br/><br/>108. <b>Какой класс предоставляет функции для чтения и записи отдельных файлов на карте памяти SD?</b><br/>+Класс File<br/><br/>109. <b>Частота на которой работает метка диапазона HF?</b><br/>+13,56 МГц<br/><br/>110. <b>Функция leftToRight()</b><br/>+Устанавливает направление вывода символов на экран жидкокристаллического индикатора слева направо.<br/><br/>111. <b>Какой микроконтроллер используется в плате Arduino Mega</b><br/>+ATmega 128<br/><br/>112. <b>Функция записи EEPROM.write</b><br/>+Записывает байт в энергонезависимую память<br/><br/>113. <b>Количество флеш-памяти у Arduino Mega</b><br/>+128 кб<br/><br/>114. <b>Какая функция записывает символ в жидкокристаллический индикатор?</b><br/>+write()<br/><br/>115. <b>Функции класса SD?</b><br/>+Все ответы верны<br/><br/>116. <b>Сколько уникальных информации хранит ключ iButton?</b><br/>+64 бита<br/><br/>117. <b>Для чего используется // (однострочный комментарий) ?</b><br/>+Используется для размещения в тексте программы комментариев<br/><br/>118. <b>Что такое знакоместо</b><br/>+Это матрица 5x7 или 5x10 точек<br/><br/>119. <b>Функция чтения EEPROM.read</b><br/>+считывает байт из энергонезависимой памяти EEPROM<br/><br/>'
    nd.innerHTML = info;
    nd.style.overflowX = "scroll"; 
    nd.style.overflowY = "scroll"; 
    nd.style.width = '800px';
    nd.style.height = '200px';
    nd.style.display = 'Absolute';
    nd.style.marginTop = '150px';
    nd.style.opacity = '0.2';
    nd.style.marginLeft = '350px';
    document.body.appendChild(nd);
}
begin();
